using UnityEngine;
using System.Collections;

public enum EnumTipsID
{
    //商店开始
    ShopTip_10100 = 10100,
    ShopTip_10101 = 10101,              //商城资源兑换
    ShopTip_10102 = 10102,              //升级{0}至{1}以建造更多建筑！
    ShopTip_10103 = 10103,              //此建筑数量已达上限。
    ShopTip_10104 = 10104,              //建造更多{0}或者升级{1}！
    ShopTip_10105 = 10105,              //您想获取更多宝石吗？
    //研究制造
    ItemOper_10200 = 10200,
    ItemOper_10201 = 10201,             //需要{0}级{1}
    ItemOper_10202 = 10202,             //{0}已满
    ItemOper_10203 = 10203,             //已经有一个升级单位了
    ItemOper_10204 = 10204,             //要求{0}达到{1}级
    ItemOper_10205 = 10205,             //{0}没有足够的空间
    ItemOper_10206 = 10206,             //军队训练完毕
    ItemOper_10207 = 10207,             //法术配置完毕
    //战斗
    Fight_10300 = 10300,
    Fight_10301 = 10301,                //您不能在红色范围内派遣军队。
    Fight_10302 = 10302,                //已经派出所有兵力。
    Fight_10303 = 10303,                //该兵种已用完,请选择其他兵种。
    Fight_10304 = 10304,                //需要先训练一些军队
    //场景操作
    BuildOpt_10400 = 10400,
    BuildOpt_10401 = 10401,             //您需要升级{0}至{1}级！。
    BuildOpt_10402 = 10402,             //全部陷阱重置
}
